const { font } = require('../lib/helpers');

module.exports = {
    name: 'menu',
    aliases: ['help', 'commands'],
    description: 'Affiche le menu des commandes',
    
    async execute({ sock, msg, config, phoneNumber }) {
        const jid = msg.key.remoteJid;
        
        const menuText = `

╭━━━━━━━━━━━━━━━✦
┃   ❏ 𝙎𝙐𝙆𝙐𝙉𝘼 - 𝙓𝙈𝘿 ❏
┃    *ᴍᴀᴋᴇ ʙʏ ꜱᴛᴇᴘʜᴅᴇᴠ*
╰━━━━━━━━━━━━━━━✦

╭◇ *ᴘʀᴏꜰɪʟ* ◇
┃❍ ᴜꜱᴇʀ : ${config.botName} 
┃❍ ᴘʀᴇғɪx : ${config.prefix} 
╰❍

╭━━━❏ *ɢᴇɴᴇʀᴀʟ* ❏
┃▢ᴘɪɴɢ
┃▢ᴍᴇɴᴜ
┃▢ꜱᴇᴛᴘʀᴇꜰɪx
┃▢ꜱᴇᴛɴᴀᴍᴇ
┃▢ᴀʟɪᴠᴇ
┃▢ʙᴜɢᴍᴇɴᴜ
┃▢ᴇᴘʜᴏᴛᴏᴍᴇɴᴜ
╰━━━━━━━━━━━━━━━╯

╭━━━❏ *ᴘᴇʀꜱᴏ* ❏
┃▢ꜱᴛᴏʀᴇ [ɴᴏᴍ]
┃▢ᴅᴇʟ [ᴛʏᴘᴇ] [ɴᴏᴍ]
┃▢ʟɪꜱᴛ
┃▢ᴀᴅ [ɴᴏᴍ]
┃▢ꜱᴅ [ɴᴏᴍ]
┃▢ꜱᴛɪᴄᴋᴇʀ [ᴍᴏᴛ]
┃▢ᴛᴀᴋᴇ
╰━━━━━━━━━━━━━━━╯

╭━━━❏ *ɢʀᴏᴜᴘᴇ* ❏
┃▢ᴀᴅᴅ [ɴᴜᴍéʀᴏ]
┃▢ ᴋɪᴄᴋ [@ᴜsᴇʀ]
┃▢ᴘʀᴏᴍᴏᴛᴇ [@ᴜsᴇʀ]
┃▢ᴅᴇᴍᴏᴛᴇ [@ᴜsᴇʀ]
┃▢ᴘᴜʀɢᴇ
┃▢ɢɴᴀᴍᴇ [ᴛᴇxᴛᴇ]
┃▢ɢᴅᴇsᴄ [ᴛᴇxᴛᴇ]
┃▢ɢʀᴏᴜᴘʟɪɴᴋ
┃▢ʟᴏᴄᴋ / ᴜɴʟᴏᴄᴋ
┃▢ᴛᴀɢᴀʟʟ [ᴍᴇssᴀɢᴇ]
┃▢ᴛᴀɢ
╰━━━━━━━━━━━━━━━╯

╭━━━❏ *ᴘʀᴏᴘ* ❏
┃▢ᴡᴇʟᴄᴏᴍᴇ [ᴏɴ/ᴏғғ]
┃▢ɢᴏᴏᴅʙʏᴇ [ᴏɴ/ᴏғғ]
┃▢ᴀɴᴛɪʟɪɴᴋ [ᴏɴ/ᴏғғ]
┃▢ᴀɴᴛɪᴛᴀɢ
┃▢ᴀɴᴛɪᴍᴇɴᴛɪᴏɴ
┃▢ᴀɴᴛɪᴅᴇʟᴇᴛᴇ
┃▢ᴠᴠ
┃▢gsettings
┃▢warnings
┃▢ᴀɴᴛɪꜱᴘᴀᴍ [ᴏɴ/ᴏғғ]
╰━━━━━━━━━━━━━━━╯

╭━━━❏ *ɪᴀ* ❏
┃▢ғᴇʟᴏ
┃▢ᴘᴇʀᴘʟᴇxɪᴛʏ
┃▢ᴘᴏᴡᴇʀʙʀᴀɪɴ
┃▢ᴛᴇᴀᴄʜᴀɴʏᴛʜɪɴɢ
┃▢ᴅᴀʟʟᴇ [ᴘʀᴏᴍᴘᴛ]
┃▢ғʟᴜx [ᴘʀᴏᴍᴘᴛ]
┃▢ᴍᴀɢɪᴄsᴛᴜᴅɪᴏ [ᴘʀᴏᴍᴘᴛ]
╰━━━━━━━━━━━━━━━╯

╭❏ *ᴛᴇʟᴇᴄʜᴀʀɢᴇᴍᴇɴᴛꜱ* ❏
┃▢ᴘʟᴀʏ [ᴛᴇxᴛᴇ]
┃▢ʏᴛᴍᴘ4 [ʟɪᴇɴ]
┃▢ᴛɪᴋᴛᴏᴋ [ʟɪᴇɴ]
┃▢ɪɴsᴛᴀɢʀᴀᴍ [ʟɪᴇɴ]
┃▢ғᴀᴄᴇʙᴏᴏᴋ [ʟɪᴇɴ]
┃▢ᴛᴡɪᴛᴛᴇʀ [ʟɪᴇɴ]
┃▢ᴘɪɴᴛᴇʀᴇsᴛ [ʟɪᴇɴ]
┃▢ᴄᴀᴘᴄᴜᴛ [ʟɪᴇɴ]
┃▢sᴘᴏᴛɪғʏ [ʟɪᴇɴ]
┃▢sᴏᴜɴᴅᴄʟᴏᴜᴅ [ʟɪᴇɴ]
┃▢ᴀᴘᴘʟᴇᴍᴜsɪᴄ [ʟɪᴇɴ]
┃▢ᴍᴇᴅɪᴀғɪʀᴇ [ʟɪᴇɴ]
┃▢ɢᴅʀɪᴠᴇ [ʟɪᴇɴ]
┃▢ɢɪᴛʜᴜʙ [ʟɪᴇɴ]
╰━━━━━━━━━━━━━━━╯

╭━━━❏ *ᴀʟᴇᴀᴛᴏɪʀᴇ* ❏
┃▢ᴡᴀɪғᴜ
┃▢ᴡᴀɪғᴜᴠ2
┃▢ɴᴇᴋᴏ
┃▢ᴊᴀᴘᴀɴ
┃▢ᴋᴏʀᴇᴀ
┃▢ǫᴜᴏᴛᴇs
┃▢ǫᴜᴏᴛᴇsᴀɴɪᴍᴇ
╰━━━━━━━━━━━━━━━╯
`;
         await sock.sendMessage(jid, { react: { text: '🀄', key: msg.key } });
         await sock.sendMessage(jid, { image: { url: "https://i.postimg.cc/gjZbjhfx/b19c205e79afb89db484c2fcfe29e978.jpg" }, caption: font(menuText) }, { quoted: null });
         if (!jid.endsWith('@newsletter')) {
                await sock.sendMessage(jid, { audio: { url: "./media/menu.mp3" }, mimetype: 'audio/mpeg' });
            }
    }
};